Revit 2023 API
DuctFittingAndAccessoryData Properties
The DuctFittingAndAccessoryData type exposes the following members.
Properties
Name | Description
AirViscosity
 The air viscosity of the duct fitting or duct accessory, Units: (kg/(ft·s)).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Origin
 The origin position of the duct fitting or duct accessory.
PartType
 The part type of the duct fitting or duct accessory.
ServerGUID
 The GUID of the duct fitting or duct accessory.
SystemClassification
 The system classification of the duct fitting or duct accessory.
See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace